Public Attributes | List of all members
API_ClassificationItem Struct Reference
Classification Manager
Specifies a classification item. More...
#include <APIdefs_Environment.h>
 Public Attributes
 API_Guid  | guid
The Archicad generated unique identifier of the classification item.
 GS::UniString  | id
The user specified unique identifier for the classification item.
 GS::UniString  | name
The display name of the classification item.
 GS::UniString  | description
The description of the classification item.
Detailed Description
Specifies a classification item.